mikeakohn/naken_asm/include/8051/stc12c56xx.inc
WDT_CONTR equ 0xe1
ISP_DATA equ 0xe2
ISP_ADDRH equ 0xe3
ISP_ADDRL equ 0xe4
ISP_CMD equ 0xe5
ISP_TRIG equ 0xe6
ISP_CONTR equ 0xe7
CLK_DIV equ 0xc7
P0M0 equ 0x93
P0M1 equ 0x94
P1M0 equ 0x91
P1M1 equ 0x92
P2M0 equ 0x95
P2M1 equ 0x96
P3M0 equ 0xb1
P3M1 equ 0xb2
SPSTAT equ 0x84
SPCTL equ 0x85
SPDAT equ 0x86
ADC_CONTR equ 0xc5
ADC_DATA equ 0xc6
ADC_LOW2 equ 0xbe
CCON equ 0xD8
CMOD equ 0xD9
CCAPM0 equ 0xDA
CCAPM1 equ 0xDB
CCAPM2 equ 0xDC
CCAPM3 equ 0xDD
CCAPM4 equ 0xDE
CCAPM5 equ 0xDF
CL equ 0xE9
CCAP0L equ 0xEA
CCAP1L equ 0xEB
CCAP2L equ 0xEC
CCAP3L equ 0xED
CCAP4L equ 0xEE
CCAP5L equ 0xEF
CH equ 0xF9
CCAP0H equ 0xFA
CCAP1H equ 0xFB
CCAP2H equ 0xFC
CCAP3H equ 0xFD
CCAP4H equ 0xFE
CCAP5H equ 0xFF
PCA_PWM0 equ 0xF2
PCA_PWM1 equ 0xF3
PCA_PWM2 equ 0xF4
PCA_PWM3 equ 0xF5
PCA_PWM4 equ 0xF6
PCA_PWM5 equ 0xF7
SADDR equ 0xA9
IPH equ 0xB7
SADEN equ 0xB9
T2CON equ 0xC8
T2MOD equ 0xC9
RCAP2L equ 0xCA
RCAP2H equ 0xCB
TL2 equ 0xCC
TH2 equ 0xCD

; bit aliases

CF equ 0xD8+7
CR equ 0xD8+6
CCF5 equ 0xD8+5
CCF4 equ 0xD8+4
CCF3 equ 0xD8+3
CCF2 equ 0xD8+2
CCF1 equ 0xD8+1
CCF0 equ 0xD8+0
CY equ 0xD0+7
AC equ 0xD0+6
F0 equ 0xD0+5
RS1 equ 0xD0+4
RS0 equ 0xD0+3
OV equ 0xD0+2
F1 equ 0xD0+1
P equ 0xD0+0
TF1 equ 0x88+7
TR1 equ 0x88+6
TF0 equ 0x88+5
TR0 equ 0x88+4
IE1 equ 0x88+3
IT1 equ 0x88+2
IE0 equ 0x88+1
IT0 equ 0x88+0
RD equ 0xB0+7
WR equ 0xB0+6
T1 equ 0xB0+5
T0 equ 0xB0+4
INT1 equ 0xB0+3
INT0 equ 0xB0+2
TXD equ 0xB0+1
RXD equ 0xB0+0
SM0 equ 0x98+7
FE equ 0x98+7
SM1 equ 0x98+6
SM2 equ 0x98+5
REN equ 0x98+4
TB8 equ 0x98+3
RB8 equ 0x98+2
TI equ 0x98+1
RI equ 0x98+0
T2EX equ 0x90+1
T2 equ 0x90+0
TF2 equ 0xC8+7
EXF2 equ 0xC8+6
RCLK equ 0xC8+5
TCLK equ 0xC8+4
EXEN2 equ 0xC8+3
TR2 equ 0xC8+2
C_T2 equ 0xC8+1
CP_RL2 equ 0xC8+0
CEX3 equ 0xA0+4
CEX2 equ 0xA0+0
CEX1 equ 0xB0+5
CEX0 equ 0xB0+7
ECI equ 0xB0+4
EA equ 0xA8+7
EPCA_LVD equ 0xA8+6
EADC_SPI equ 0xA8+5
ES equ 0xA8+4
ET1 equ 0xA8+3
EX1 equ 0xA8+2
ET0 equ 0xA8+1
EX0 equ 0xA8+0
PPCA_LVD equ 0xB8+6
PADC_SPI equ 0xB8+5
PS equ 0xB8+4
PT1 equ 0xB8+3
PX1 equ 0xB8+2
PT0 equ 0xB8+1
PX0 equ 0xB8+0

; xdata

